# IsTaggingLink Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElementTag..::..IsTaggingLink Property
SpatialElementTag Class See Also
---
Identifies if the tag has reference to a spatial element in a linked document or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool IsTaggingLink { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsTaggingLink As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsTaggingLink {
	bool get ();
}
```

# See Also
SpatialElementTag Class
Autodesk.Revit.DB Namespace